In [6]:
import numpy as np
import pandas as pd

# 结合 numpy 创建一个 (3, 10) 区间内的包含 5 个随机整数的一维数组 ndarray 为 data1，
# 并以此 data 再创建索引为 a, b, c, d, e 的 Series 为 s1
data1 = np.random.randint(3,10,(5))
print(data1)
s1 = pd.Series(data1, index = ['a','b','c','d','e'])
print(s1)

[3 7 6 4 6]
a    3
b    7
c    6
d    4
e    6
dtype: int64

In [8]:
# 请分别用位置索引和标签索引的方式提取是 s1 的后三个数
print(s1[-3:])            #位置索引
print(s1['c':'e'])        #标签索引

c    6
d    4
e    6
dtype: int64
c    6
d    4
e    6
dtype: int64

In [13]:
# 请用字典的形式创建一个DataFrame，将下方表格数据存储进去 
# （任务提示：创建 DataFrame 有多种方式，本题以字典形式创建。阅读参考文章④）
dic = {'year':{'0':2017, '1':2018, '2':2019},
       'price':{'0':10, '1':20, '2':30}}
print(pd.DataFrame(dic, index = list('012'),columns = ['year','price']))

   year  price
0  2017     10
1  2018     20
2  2019     30

In [45]:
# 结合 numpy 创建一个 (5, 15) 区间内，形状为 5 行 3 列的随机整数数组为 data2，
# 并以此为基础创建 index 为 ['a', 'c', 'e', 'f', 'h']，columns 为 ['one', 'two', 'three'] 的 DataFrame，并命名为 df_test
data2 = np.random.randint(5,15,(5,3))
df_test = pd.DataFrame(data2, index = list('acefh'), columns = ['one', 'two', 'three'])
df_test

   one  two  three
a    7   11     11
c   12   13     12
e   13   14     12
f    8    8      9
h    6   12     14

In [51]:
# 运用 loc 索引以及替换的知识，按下列要求对 df_test 进行增、改、替操作。
# 完成上述要求后，将该数据命名为 df_change（任务提示：一般用 df.loc[行，列] = ？ 做替换。阅读参考文章⑤⑥）
# (1) 将 a 行 one 列处替换成空值
df_test.loc['a','one'] = np.nan

# (2) 将 c 行 two 列处替换成 -99
df_test.loc['c','two'] = -99

# (3) 将 c 行 three 列处替换成 -99
df_test.loc['c','three'] = -99

# (4) 将 a 行 two 列处替换成 -100
df_test.loc['a','two'] = -100

# (5) 新增 four 列，值为 test
df_test['four'] = 'test'

# (6) 重置索引为 ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']
df_change = df_test.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

df_change

   one    two  three  four
a  NaN -100.0   11.0  test
b  NaN    NaN    NaN   NaN
c   12  -99.0  -99.0  test
d  NaN    NaN    NaN   NaN
e   13   14.0   12.0  test
f    8    8.0    9.0  test
g  NaN    NaN    NaN   NaN
h    6   12.0   14.0  test

In [52]:
# 删除 df_change 中存在缺失值的所有行
df_change.dropna()

  one   two  three  four
c  12 -99.0  -99.0  test
e  13  14.0   12.0  test
f   8   8.0    9.0  test
h   6  12.0   14.0  test

In [53]:
# 删除 df_change 中所有值都为 NaN 值的行
df_change.dropna(how = 'all')

   one    two  three  four
a  NaN -100.0   11.0  test
c   12  -99.0  -99.0  test
e   13   14.0   12.0  test
f    8    8.0    9.0  test
h    6   12.0   14.0  test

In [54]:
# df_change 中的所有缺失值（即 NaN）以 0 填充
df_change.fillna(0)

   one    two  three  four
a    0 -100.0   11.0  test
b    0    0.0    0.0     0
c   12  -99.0  -99.0  test
d    0    0.0    0.0     0
e   13   14.0   12.0  test
f    8    8.0    9.0  test
g    0    0.0    0.0     0
h    6   12.0   14.0  test

In [55]:
# 删除 df_change中的重复行
df_change.drop_duplicates()

   one    two  three  four
a  NaN -100.0   11.0  test
b  NaN    NaN    NaN   NaN
c   12  -99.0  -99.0  test
e   13   14.0   12.0  test
f    8    8.0    9.0  test
h    6   12.0   14.0  test